Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteToSheet Property
 Elements copied to Sheets can only be copied from other Sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteToSheet { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteToSheet As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteToSheet {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace